wegam/STM32F10xUSBW/Examples/APP/SPI_FLASH.C
/******************************** User_library *********************************
* 文件名 	: SPI_FLASH.C
* 作者   	: wegam@sina.com
* 版本   	: V
* 日期   	: 2017/04/16
* 说明   	: 
********************************************************************************
SPI_FLASH使用功能测试
1）需要宏定义 SPI_FLASH
2）使用USB_TEST 板测试
3）需要宏定义SPI引脚
--------------------------------FLASH部分术语解析-----------------------------
Sector：比BLOCK更小的单位
Block：	大部分的FLASH都以64K为单位空间ERASE
Chip：	整片FLASH
Page：
例：(256-byte per page)(4K-byte per sector/16page per sector)(64K-byte per block/16-sector per block)(8-block per chip)
*******************************************************************************/
#ifdef SPI_FLASH							//如果定义了SPI_FLASH 此功能生效
#include "SPI_FLASH.H"

#define USB_TEST_BD				//USB_TEST板
//#define CMSIS_CDC_BD			//CMSIS-CDC板
//#include "stdlib.h"
//#include "stdio.h"


#include "stm32f10x_spi.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_dma.h"
//#include "stm32f10x_nvic.h"

//#include "STM32_WOW.H"
#include "STM32_PWM.H"
#include "STM32_SYS.H"
#include "STM32_SPI.H"
#include "STM32_GPIO.H"
#include "STM32_SYSTICK.H"
#include "STM32_USART.H"

#define 	Dummy_Byte 0xA5					//FLASH空操作数
//#define		SPI_FLASH_PageSize   		0x100		//Flash页大小
#define		FLASH_WriteAddress     	0x00
#define		FLASH_ReadAddress      	FLASH_WriteAddress
#define		FLASH_SectorToErase    	FLASH_WriteAddress
#define 	FlASH_BufferSize				512
#define 	USART_BufferSize				FlASH_BufferSize

u32 Temp = 0;
SPI_FLASH_TypeDef	FLASH_Conf;

u16	FLASH_ChipEraseFlag=0;			//启动后擦除一次FLASH
u16	RWF=0;			//读写标志位

u32 FlashAddr=0;
u32 FlashID=0;
u8 FlashStatus=WEL_Flag;
u8 RevBuffer[FlASH_BufferSize]={0};
u8 SendBuffer[FlASH_BufferSize]={0x9F,0xFF,0XFF,0XFF};
u8 testSbuffer[FlASH_BufferSize]={0xf1,0xf2,0xf3,0xf4,0xf5,0xf6,0xf7,0xf8,0xf9,0xfA};
u8 testRbuffer[FlASH_BufferSize]={0};

u8 RxdBuffe[USART_BufferSize]={0};
u8 RevBuffe[USART_BufferSize]={0};

u8 TxdBuffe[USART_BufferSize]={0};
u8 TevBuffe[USART_BufferSize]={0};

/*******************************************************************************
* 函数名		:	
* 功能描述	:	 
* 输入		:	
* 输出		:
* 返回 		:
*******************************************************************************/
void SPI_FLASH_Configuration(void)
{
	SYS_Configuration();											//系统配置 STM32_SYS.H	
	GPIO_DeInitAll();																							//将所有的GPIO关闭----V20170605
	PWM_OUT(TIM2,PWM_OUTChannel1,1,500);			//PWM设定-20161127版本
	
	USART_DMA_ConfigurationNR	(USART1,115200,(u32*)RxdBuffe,USART_BufferSize);	//USART_DMA配置--查询方式，不开中断
	
	SPI_FLASH_Conf(&FLASH_Conf);			//SPI设置

	FlashStatus=WEL_Flag;	
	SysTick_Configuration(100);							//系统嘀嗒时钟配置72MHz,单位为uS
}

/*******************************************************************************
* 函数名		:	
* 功能描述	:	 
* 输入		:	
* 输出		:
* 返回 		:
*******************************************************************************/
void SPI_FLASH_Server(void)
{
	u16 RxNum=0;
	u32 Addr=0;
	
	RxNum=USART_ReadBufferIDLE			(USART1,(u32*)RevBuffe,(u32*)RxdBuffe);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数，然后重新将接收缓冲区地址指向RxdBuffer
	
	if(RxNum&&(FlashAddr<128*4*1024))
	{		
		SPI_FLASH_BufferWrite(&FLASH_Conf,RevBuffe, FlashAddr, RxNum);	//FLASH写缓冲数据
		SPI_FLASH_BufferRead(&FLASH_Conf,testSbuffer,  FlashAddr, RxNum);
		FlashAddr+=RxNum;
	}
//	itoa(1234567890,TxdBuffe,10);//搜索10代表十进制
	
	if(Temp!=0)
	{
		Temp=0;

	}
	else
	{
		Temp=1;

	}
	
	if(FLASH_ChipEraseFlag<=3000)
	{
		FLASH_ChipEraseFlag++;
		if(FLASH_ChipEraseFlag==3000)
		{
//			for(Addr=0;Addr<128*4*1024;)	//524288			//523776
//			{
//				SPI_FLASH_BufferRead(&FLASH_Conf,testRbuffer, Addr, FlASH_BufferSize);
//				Addr+=FlASH_BufferSize;
//			}
			
//			for(Addr=0;Addr<128*4*1024;)	//524288			//523776
//			{
//				SPI_FLASH_BufferWrite(&FLASH_Conf,testSbuffer, Addr, FlASH_BufferSize);
//				Addr+=FlASH_BufferSize;
//			}
			
		
//		SPI_FLASH_BulkErase(&FLASH_Conf);										//FLASH整片擦除
//		SPI_FLASH_ChipErase(&FLASH_Conf);										//FLASH整片擦除
//		SPI_FLASH_SectorErase(&FLASH_Conf,FLASH_ReadAddress);	//Flash扇区擦除
			
//			SPI_FLASH_BufferWrite(&FLASH_Conf,testSbuffer, FLASH_WriteAddress, FlASH_BufferSize);	//FLASH写缓冲数据
			SPI_FLASH_BufferRead(&FLASH_Conf,testSbuffer, FLASH_WriteAddress, FlASH_BufferSize);
		}
	}
	RWF++;
	if(RWF==2000)
	{

//		SPI_FLASH_SectorErase(&FLASH_Conf,FLASH_SectorToErase);			//擦除扇区
//		SPI_FLASH_BulkErase(&FLASH_Conf);										//FLASH块擦除
//		SPI_FLASH_ChipErase(&FLASH_Conf);										//FLASH整片擦除

//		SPI_FLASH_BufferWrite(&FLASH_Conf,testSbuffer, FLASH_WriteAddress, FlASH_BufferSize);	//FLASH写缓冲数据
		
		
	}
	else if(RWF==3000)
	{
		RWF=0; 
//		SPI_FLASH_BufferRead(&FLASH_Conf,testRbuffer, FLASH_ReadAddress, FlASH_BufferSize);
		
//		for(Addr=0;Addr<128*4*1024;)
//		{
//			SPI_FLASH_BufferRead(&FLASH_Conf,testRbuffer, Addr, FlASH_BufferSize);
//			Addr+=512;
//		}

		
	}
//	Temp=0;
//	Temp=SPI_FLASH_ReadID();
	
//	SPI_FLASH_CS_ENABLE;
//	SPI_FLASH_SendByte(0x9F);
//	SPI_FLASH_CS_DISABLE;
//	u16 num=0xFFFE;
//	SPI_Cmd(SPI1, ENABLE);
	/*
	//1）********SPI发送
	if(SPI1_NSS==SPI_NSS_Hard)		//1）**********NSS片选方式为硬件方式（SPI_NSS_Hard）时发送数据
	{
		SPI_Cmd(SPI1, ENABLE);
		while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
		SPI_I2S_SendData(SPI1,0X55);
		while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_BSY) == SET);
		SPI_Cmd(SPI1, DISABLE);
	}
	else				//2）**********NSS片选方式为软件件方式（SPI_NSS_Soft）时发送数据
	{
		GPIO_ResetBits(GPIOA,GPIO_Pin_4);
		while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
		SPI_I2S_SendData(SPI1,0X55);
		while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_BSY) == SET);
		GPIO_SetBits(GPIOA,GPIO_Pin_4);
	}
	//1.2）********SPI2发送
	if(SPI2_NSS==SPI_NSS_Hard)		//1）**********NSS片选方式为硬件方式（SPI_NSS_Hard）时发送数据
	{	
		SPI_Cmd(SPI2, ENABLE);
		while (SPI_I2S_GetFlagStatus(SPI2, SPI_I2S_FLAG_TXE) == RESET);
		SPI_I2S_SendData(SPI2,0XAA);
		while (SPI_I2S_GetFlagStatus(SPI2, SPI_I2S_FLAG_BSY) == SET);
		SPI_Cmd(SPI2, DISABLE);
	}
	else													//2）**********NSS片选方式为软件件方式（SPI_NSS_Soft）时发送数据
	{
		GPIO_ResetBits(GPIOB,GPIO_Pin_12);
		while (SPI_I2S_GetFlagStatus(SPI2, SPI_I2S_FLAG_TXE) == RESET);
		SPI_I2S_SendData(SPI2,0XAA);
		while (SPI_I2S_GetFlagStatus(SPI2, SPI_I2S_FLAG_BSY) == SET);
		GPIO_SetBits(GPIOB,GPIO_Pin_12);
	}
	*/


//		GPIO_ResetBits(GPIOA,GPIO_Pin_4);
//		while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
//		SPI_I2S_SendData(SPI1,0X55);
//		while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_BSY) == SET);
//		GPIO_SetBits(GPIOA,GPIO_Pin_4);
		
		
