wegam/STM32F10xUSBW/Examples/APP/SPI_FLASH.C
      while (NumOfPage--)			//将剩余的整页数据写入FLASH
      {
        SPI_FLASH_PageWrite(SPI_Conf,pBuffer, WriteAddr, SPI_FLASH_PageSize);
        WriteAddr +=  SPI_FLASH_PageSize;
        pBuffer += SPI_FLASH_PageSize;
      }

      if (NumOfSingle != 0)		//判断是否还有剩余（不够一页）待写入
      {
        SPI_FLASH_PageWrite(SPI_Conf,pBuffer, WriteAddr, NumOfSingle);
      }
    }
  }
}

/*******************************************************************************
* Function Name  : SPI_FLASH_BufferRead
* Description    : Reads a block of data from the FLASH.
* Input          : - pBuffer : pointer to the buffer that receives the data read
*                    from the FLASH.
*                  - ReadAddr : FLASH's internal address to read from.
*                  - NumByteToRead : number of bytes to read from the FLASH.
* Output         : None
* Return         : None
*******************************************************************************/
void SPI_FLASH_BufferRead(
													SPI_FLASH_TypeDef *SPI_Conf,
													u8* pBuffer, 					//数据的数据存储缓冲区
													u32 ReadAddr, 				//读取的起始地址
													u16 NumByteToRead			//待读取字节数
)
{
	if(NumByteToRead)
	{
	//	while(SPI_FLASH_ReadStatus(&FLASH_Conf)&WIP_Flag==WIP_Flag);		//读Flash状态寄存器
		SPI_FLASH_WaitForWriteEnd(SPI_Conf);	//等待FLASH写完成
		
		SPI_FLASH_ENALBE(SPI_Conf);								//SPI_FLASH_使能
		
		/* Send "Read from Memory " instruction */
		SPI_FLASH_WriteReadByte(SPI_Conf,Flash_READ);

		/* Send ReadAddr high nibble address byte to read from */
		SPI_FLASH_WriteReadByte(SPI_Conf,(ReadAddr & 0xFF0000) >> 16);
		/* Send ReadAddr medium nibble address byte to read from */
		SPI_FLASH_WriteReadByte(SPI_Conf,(ReadAddr& 0xFF00) >> 8);
		/* Send ReadAddr low nibble address byte to read from */
		SPI_FLASH_WriteReadByte(SPI_Conf,ReadAddr & 0xFF);

		while (NumByteToRead--) /* while there is data to be read */
		{
			/* Read a byte from the FLASH */
			*pBuffer = SPI_FLASH_WriteReadByte(SPI_Conf,Dummy_Byte);
			/* Point to the next location where the byte read will be saved */
			pBuffer++;
		}
		SPI_FLASH_DISALBE(SPI_Conf);											//SPI_FLASH_关闭
	}
}


/*******************************************************************************
* Function Name  : SPI_FLASH_StartReadSequence
* Description    : Initiates a read data byte (READ) sequence from the Flash.
*                  This is done by driving the /CS line low to select the device,
*                  then the READ instruction is transmitted followed by 3 bytes
*                  address. This function exit and keep the /CS line low, so the
*                  Flash still being selected. With this technique the whole
*                  content of the Flash is read with a single READ instruction.
* Input          : - ReadAddr : FLASH's internal address to read from.
* Output         : None
* Return         : None
*******************************************************************************/
void SPI_FLASH_StartReadSequence(SPI_FLASH_TypeDef *SPI_Conf,u32 ReadAddr)
{
//  /* Select the FLASH: Chip Select low */
//  SPI_FLASH_CS_LOW(SPI_Conf);

  /* Send "Read from Memory " instruction */
  SPI_FLASH_WriteReadByte(SPI_Conf,Flash_READ);

  /* Send the 24-bit address of the address to read from -----------------------*/
  /* Send ReadAddr high nibble address byte */
  SPI_FLASH_WriteReadByte(SPI_Conf,(ReadAddr & 0xFF0000) >> 16);
  /* Send ReadAddr medium nibble address byte */
  SPI_FLASH_WriteReadByte(SPI_Conf,(ReadAddr& 0xFF00) >> 8);
  /* Send ReadAddr low nibble address byte */
  SPI_FLASH_WriteReadByte(SPI_Conf,ReadAddr & 0xFF);
}
/*******************************************************************************
* Function Name  : SPI_FLASH_SendHalfWord
* Description    : Sends a Half Word through the SPI interface and return the
*                  Half Word received from the SPI bus.
* Input          : Half Word : Half Word to send.
* Output         : None
* Return         : The value of the received Half Word.
*******************************************************************************/
u16 SPI_FLASH_SendHalfWord(SPI_FLASH_TypeDef *SPI_Conf,u16 HalfWord)
{
  /* Loop while DR register in not emplty */
  while (SPI_I2S_GetFlagStatus(SPI_Conf->SPIx, SPI_I2S_FLAG_TXE) == RESET);

  /* Send Half Word through the SPI1 peripheral */
  SPI_I2S_SendData(SPI_Conf->SPIx, HalfWord);

  /* Wait to receive a Half Word */
  while (SPI_I2S_GetFlagStatus(SPI_Conf->SPIx, SPI_I2S_FLAG_RXNE) == RESET);

  /* Return the Half Word read from the SPI bus */
  return SPI_I2S_ReceiveData(SPI_Conf->SPIx);
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*******************************************************************************/
void SPI_FLASH_GetInfo(SPI_FLASH_TypeDef *SPI_Conf)		//获取FLASH信息---根据ID确定FLASH型号，配置页大小，扇区大小，块大小参数
{
	u32 SPI_Flash_ID=0;
	SPI_Flash_ID=SPI_FLASH_ReadID(SPI_Conf);	//获取读FlashID
	//根据ID信息配置相当参数
	switch((u8)(SPI_Flash_ID>>16))		//厂商编号
	{
		case 0xC2:	//MXIC Manufacturer ID
		{
			switch((u8)(SPI_Flash_ID>>8))	//memory type ID
			{
				case	0x20:			//SPI_FLASH
				{
					switch((u8)SPI_Flash_ID)	//芯片型号
					{
						case	0x13:	//MX25L4006E
						{
							SPI_Conf->SPI_FLASH_PageSize		=	256;			//页大小
							SPI_Conf->SPI_FLASH_SectorSize	=	4096;			//扇区大小
							SPI_Conf->SPI_FLASH_BlockSize		=	65536;		//块大小
						}
						break;						
						default	:break;
					}
				}
				break;
				default :break;
			}
		}
		break;
		default:		//默认配置
		{
//			SPI_Conf->SPI_FLASH_PageSize=256;			//页大小
//			SPI_Conf->SPI_FLASH_SectorSize=4096;	//扇区大小
//			SPI_Conf->SPI_FLASH_BlockSize=65536;	//块大小
		}
		break;
	}
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*******************************************************************************/
void SPI_FLASH_ENALBE(SPI_FLASH_TypeDef *SPI_Conf)				//SPI_FLASH_使能
{
	if(SPI_Conf->SPI_Flash_NSS_CsFlg==1)														//如果使用纯硬件SPI1（含CS脚），UseSPI1_flg=1，否则UseSPI1_flg=0；
	{
		SPI_Cmd(SPI_Conf->SPIx, ENABLE);															//使能SPI--CS自动拉低
	}
	else
	{
		
		SPI_Cmd(SPI_Conf->SPIx, ENABLE);	//使能SPI
		__nop();
		__nop();
		__nop();
		__nop();
		__nop();
		__nop();
		__nop();
		__nop();
		__nop();
		__nop();
		__nop();
		__nop();
		__nop();
		__nop();
		__nop();
		GPIO_ResetBits(SPI_Conf->SPI_CS_PORT, SPI_Conf->SPI_CS_PIN);	//CS_LOW片选使能
																	
