wegam/STM32F10xUSBW/Examples/APP/SPI_FLASH.C
	}
	
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*******************************************************************************/
void SPI_FLASH_DISALBE(SPI_FLASH_TypeDef *SPI_Conf)				//SPI_FLASH_关闭
{	
	if(SPI_Conf->SPI_Flash_NSS_CsFlg==1)														//如果使用纯硬件SPI1（含CS脚），UseSPI1_flg=1，否则UseSPI1_flg=0；
	{
		SPI_Cmd(SPI_Conf->SPIx, DISABLE);															//关闭SPI--CS自动拉高
	}
	else
	{
		SPI_Cmd(SPI_Conf->SPIx, DISABLE);															//关闭SPI
		__nop();
		__nop();
		__nop();
		__nop();
		__nop();
		__nop();
		__nop();
		__nop();
		__nop();
		__nop();
		__nop();
		__nop();
		__nop();
		__nop();
		__nop();
		GPIO_SetBits(SPI_Conf->SPI_CS_PORT, SPI_Conf->SPI_CS_PIN);		//CS_HIGH禁止片选
	}	
}

/*******************************************************************************
* Function Name  : SPI_FLASH_SendByte
* Description    : Sends a byte through the SPI interface and return the byte
*                  received from the SPI bus.
* Input          : byte : byte to send.
* Output         : None
* Return         : The value of the received byte.
*******************************************************************************/
u8 SPI_FLASH_WriteReadByte(SPI_FLASH_TypeDef *SPI_Conf,u8 byte)
{
  /* Loop while DR register in not emplty */
  while (SPI_I2S_GetFlagStatus(SPI_Conf->SPIx, SPI_I2S_FLAG_TXE) == RESET);
  /* Send byte through the SPI1 peripheral */
  SPI_I2S_SendData(SPI_Conf->SPIx, byte);
  /* Wait to receive a byte */
  while (SPI_I2S_GetFlagStatus(SPI_Conf->SPIx, SPI_I2S_FLAG_RXNE) == RESET);
  /* Return the byte read from the SPI bus */
  return SPI_I2S_ReceiveData(SPI_Conf->SPIx);
}
/*******************************************************************************
* Function Name  : SPI_FLASH_WriteEnable
* Description    : Enables the write access to the FLASH.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void SPI_FLASH_WriteEnable(SPI_FLASH_TypeDef *SPI_Conf)		//0x06
{
	u8 Status=0;
	SPI_FLASH_WaitForWriteEnd(SPI_Conf);			//等待FLASH写完成	
	
	SPI_FLASH_ENALBE(SPI_Conf);								//SPI_FLASH_使能
	SPI_Cmd(SPI_Conf->SPIx, ENABLE);					//使能SPI
	SPI_FLASH_WriteReadByte(SPI_Conf,Flash_WREN);	//0x06使能写命令
	SPI_FLASH_DISALBE(SPI_Conf);							//SPI_FLASH_关闭
	
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	
	SPI_FLASH_ENALBE(SPI_Conf);								//SPI_FLASH_使能
	SPI_FLASH_WriteReadByte(SPI_Conf,Flash_WRSR);	//0x01写状态寄存器命令
	SPI_FLASH_WriteReadByte(SPI_Conf,0x00);				//使能写状态寄存器参数--清除写保护
	SPI_FLASH_DISALBE(SPI_Conf);							//SPI_FLASH_关闭
	
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	
	SPI_FLASH_ENALBE(SPI_Conf);								//SPI_FLASH_使能
	SPI_Cmd(SPI_Conf->SPIx, ENABLE);					//使能SPI
	SPI_FLASH_WriteReadByte(SPI_Conf,Flash_WREN);	//0x06使能写命令
	SPI_FLASH_DISALBE(SPI_Conf);							//SPI_FLASH_关闭
	
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	
	do																				//等待写允许
	{
		SPI_FLASH_ENALBE(SPI_Conf);													//SPI_FLASH_使能
		
		SPI_FLASH_WriteReadByte(SPI_Conf,Flash_RDSR);						//写入读状态命令 */		
		Status = SPI_FLASH_WriteReadByte(SPI_Conf,Dummy_Byte);	//读状态 */	
		
		SPI_FLASH_DISALBE(SPI_Conf);									//SPI_FLASH_关闭
		__nop();
		__nop();
		__nop();
		__nop();
		__nop();
		__nop();
		__nop();
		__nop();
	}while((Status&WEL_Flag)!=WEL_Flag);
	
//	SPI_FLASH_DISALBE(SPI_Conf);										//SPI_FLASH_关闭
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
}
/*******************************************************************************
* Function Name  : SPI_FLASH_WriteDisable
* Description    : Enables the write access to the FLASH.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void SPI_FLASH_WriteDisable(SPI_FLASH_TypeDef *SPI_Conf)			//0x写保护--写禁止
{
	u32 Status=0x00;
	
	Status=SPI_FLASH_ReadStatus(SPI_Conf);			//读Flash状态寄存器
	Status=Status|0x1C;													//所有的保护
	
  SPI_FLASH_ENALBE(SPI_Conf);										//SPI_FLASH_使能
	
	SPI_FLASH_WriteReadByte(SPI_Conf,Flash_WRDI);	 	//发送写保护命令
	SPI_FLASH_WriteStatus(SPI_Conf,Status);			//写Flash状态寄存器
	
	SPI_FLASH_DISALBE(SPI_Conf);									//SPI_FLASH_关闭
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	
}
/*******************************************************************************
* Function Name  : SPI_FLASH_WaitForWriteEnd
* Description    : Polls the status of the Write In Progress (WIP) flag in the
*                  FLASH's status  register  and  loop  until write  opertaion
*                  has completed.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void SPI_FLASH_WaitForWriteEnd(SPI_FLASH_TypeDef *SPI_Conf)	//等待FLASH写完成
{
  u8 FLASH_Status = 0;

  SPI_FLASH_ENALBE(SPI_Conf);										//SPI_FLASH_使能
	
  SPI_FLASH_WriteReadByte(SPI_Conf,Flash_RDSR);						//发送读状态寄存器命令
  do			//循环读取状态值，直到芯片退出忙状态
  {
    FLASH_Status = SPI_FLASH_WriteReadByte(SPI_Conf,Dummy_Byte);		//循环读取状态值，
		__nop();
		__nop();
		__nop();
		__nop();
		__nop();
		__nop();
		__nop();
  }
  while ((FLASH_Status & WIP_Flag) == WIP_Flag); 			

	SPI_FLASH_DISALBE(SPI_Conf);									//SPI_FLASH_关闭
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
	__nop();
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*******************************************************************************/
u8 SPI_FLASH_ReadStatus(SPI_FLASH_TypeDef *SPI_Conf)
{
	u32 Status=0x00;

  SPI_FLASH_ENALBE(SPI_Conf);												//SPI_FLASH_使能
	
	SPI_FLASH_WriteReadByte(SPI_Conf,Flash_RDSR);					//0x05写入读状态命令
	Status = SPI_FLASH_WriteReadByte(SPI_Conf,Dummy_Byte);	//读取状态值
	
	SPI_FLASH_DISALBE(SPI_Conf);											//SPI_FLASH_关闭
	
	return Status;																		//返回状态值
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*******************************************************************************/
void SPI_FLASH_WriteStatus(SPI_FLASH_TypeDef *SPI_Conf,u8 Status)		//写Flash状态寄存器
{
	SPI_FLASH_WriteEnable(SPI_Conf);					//0x06写使能
	
	SPI_FLASH_ENALBE(SPI_Conf);								//SPI_FLASH_使能
	
	SPI_FLASH_WriteReadByte(SPI_Conf,Flash_WRSR);	//0x01写状态寄存器命令
	SPI_FLASH_WriteReadByte(SPI_Conf,Status);			//写状态寄存器参数
	
	SPI_FLASH_DISALBE(SPI_Conf);							//SPI_FLASH_关闭	
}

